/*--------------------------------------Задача №9--------------------------------------------
Напишите функцию get_order(string), которая отсортирует все слова в заданном предложении string в алфавитном порядке.
Например: get_order("ноты акустика гитара"), функция должна вернуть "акустика гитара ноты"
--------------------------------------------------------------------------------------------*/

function get_order(string) {
    if (typeof string !== 'string') {
        console.error('Это не строка!');
        return null;
    }

    let array = string.split(' ');
    array = array.sort();
    string = array.join(' ');
    return string;
}

let str1 = 'ноты акустика гитара';
console.log( get_order(str1) );
