/*==================================Задача №2=============================================
Создайте массив с четными числами в диапазоне от 500 до 888 включительно.
==========================================================================================*/
let min = 500;
let max = 888;

let array2 = [];

min = Number(min);
max = Number(max);

function get_even (arr) {

    for (let i = min; i <= max; i++) { // или можно вместо i++  написать i += 2
        if (i % 2 !== 0) {
            i++;
        } else {
            arr.push(i);
            i++
        }
    }
    return arr;
}

console.log( get_even(array2) )
