/*==================================Задача №3=============================================
Необходимо написать функцию, которая принимает слово в виде строки,
функция будет возвращать слово с буквами в обратном порядке,
например в функцию передаем слово “ТЕЛЕФОН”, на выходе имеем слово «НОФЕЛЕТ».
==========================================================================================*/

let word = prompt('Введите слово:');

function show_reverse_word(word) {
    let split_word = word.split('');
    let reverse_word = split_word.reverse();
    return reverse_word.join('');
}

alert(`Ваше слово в обратном порядке: ${show_reverse_word(word)}`);
