/*==================================Задача №1=============================================
Напишите функцию get_min( arr ), которая находит минимальное значение в заданном массиве.
==========================================================================================*/

let array_1 = [12, 23, 24, 456, -35, 748, -354, -50, 0, 92, 99, 74, -77, 49,]

function get_min (arr) {
    // function compare_number(a, b) {
    //     return a - b;
    // }
    // console.log (arr.sort(compare_number));
    console.log (arr.sort( (a, b) => a - b) );
    return arr[0];
}

console.log(`Минимальное значение массива: ${get_min(array_1)}.`);
